---

C#Visual BasicVisual C++

Revit 2024 API
---
PolyLine..::..GetTransformed Method
PolyLine Class See Also Send Feedback
---

Gets the copy of the polyline which is applied the specified transformation.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public PolyLine GetTransformed(
    	Transform transform
    )

Visual Basic
---

    Public Function GetTransformed ( _
    	transform As Transform _
    ) As PolyLine

Visual C++
---

    public:
    PolyLine^ GetTransformed(
    	Transform^ transform
    )

#### Parameters

transform
    Type: Autodesk.Revit.DB..::..Transform

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the transform is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also

PolyLine Class

Autodesk.Revit.DB Namespace